# LEET CODE
## Problem-2356: Number of Unique Subjects Taught by Each Teacher
Class: Easy

Source: https://leetcode.com/problems/number-of-unique-subjects-taught-by-each-teacher/

## Description
Table: Teacher
| Column Name | Type |
|-------------|------|
| teacher_id  | int  |
| subject_id  | int  |
| dept_id     | int  |

(subject_id, dept_id) is the primary key (combinations of columns with unique values) of this table.

Each row in this table indicates that the teacher with teacher_id teaches the subject subject_id in the department dept_id.

## To Do
Write a solution to calculate the number of unique subjects each teacher teaches in the university.

Return the result table in any order.

The result format is shown in the following example.

## Example

Input:

Teacher table:
| teacher_id | subject_id | dept_id |
|------------|------------|---------|
| 1          | 2          | 3       |
| 1          | 2          | 4       |
| 1          | 3          | 3       |
| 2          | 1          | 1       |
| 2          | 2          | 1       |
| 2          | 3          | 1       |
| 2          | 4          | 1       |

Output:  
| teacher_id | cnt |
|------------|-----|
| 1          | 2   |
| 2          | 4   |

Explanation: 
- Teacher 1:
  - They teach subject 2 in departments 3 and 4.
  - They teach subject 3 in department 3.
- Teacher 2:
  - They teach subject 1 in department 1.
  - They teach subject 2 in department 1.
  - They teach subject 3 in department 1.
  - They teach subject 4 in department 1.

## Importing

In [2]:
import pandas as pd
from pandasql import sqldf

## Define Schema

In [3]:
data = [[1, 2, 3], [1, 2, 4], [1, 3, 3], [2, 1, 1], [2, 2, 1], [2, 3, 1], [2, 4, 1]]
Teacher = pd.DataFrame(data, columns=['teacher_id', 'subject_id', 'dept_id']).astype({'teacher_id':'Int64', 'subject_id':'Int64', 'dept_id':'Int64'})

In [4]:
Teacher

   teacher_id  subject_id  dept_id
0           1           2        3
1           1           2        4
2           1           3        3
3           2           1        1
4           2           2        1
5           2           3        1
6           2           4        1

## Task

In [7]:
# Define the SQL query
query = """
SELECT teacher_id, COUNT(DISTINCT(subject_id)) AS cnt
FROM Teacher
GROUP BY teacher_id
;
"""

# Excute the query using pandasql
result = sqldf(query, env={'Teacher':Teacher})

# Display the result dataframe
display(result)

   teacher_id  cnt
0           1    2
1           2    4